var contract = """Привет, дорогой пользователь!

Добро пожаловать в наше приложение турагентства. Мы очень рады видеть тебя здесь! Прежде чем ты начнешь использовать наше приложение, просим внимательно ознакомиться с нашими условиями использования. Ниже приведено детальное описание условий, которые регулируют твое использование нашего приложения турагентства.

1. Принятие условий
Твое использование этого приложения подразумевает полное согласие с условиями настоящего соглашения и нашей политикой конфиденциальности. Если ты не согласен с нашими условиями, пожалуйста, не используй наше приложение.

2. Услуги турагентства
Наше приложение предоставляет информацию о туров, отелях, бронирование билетов и других услугах, связанных с путешествиями. Мы стремимся предоставлять тебе самые точные и актуальные данные, однако не гарантируем полную достоверность информации, так как некоторые данные могут меняться в реальном времени.

3. Регистрация и аккаунты
Для доступа к определенным функциям приложения требуется регистрация. Мы ценим твою конфиденциальность и обязуемся защищать твои личные данные в соответствии с нашей политикой конфиденциальности.

4. Ограничения ответственности
Мы не несем ответственности за прямые или косвенные убытки, возникшие в результате использования нашего приложения или связанные с его использованием. Мы также не несем ответственности за действия третьих лиц, связанные с использованием нашего приложения.

5. Авторские права
Весь контент, представленный в нашем приложении, охраняется авторскими правами. Любое незаконное копирование или использование контента без разрешения запрещено.

6. Изменения в условиях
Мы оставляем за собой право изменять условия использования приложения без предварительного уведомления. Поэтому мы рекомендуем периодически проверять условия использования на предмет изменений.

7. Контактная информация
Если у тебя возникли вопросы по поводу настоящего соглашения, пожалуйста, свяжись с нами по адресу support@travelagencyapp.com.

8. Уведомления и обновления
Мы можем время от времени отправлять тебе уведомления о наших услугах, специальных предложениях и обновлениях через приложение, по SMS или по электронной почте. Также ты можешь отказаться от получения этих уведомлений в настройках приложения.

9. Использование информации
Мы можем анонимизировать и анализировать данные о твоем использовании приложения для улучшения качества наших услуг, исследований рынка и персонализации контента.

10. Реклама
Наше приложение может содержать рекламные материалы от третьих лиц. Мы не несем ответственности за содержание этих рекламных материалов и последствия их использования.

11. Интеллектуальная собственность
Все товарные знаки, логотипы, изображения и другой контент, представленный в нашем приложении, являются собственностью нашего турагентства и защищены законом об интеллектуальной собственности.

12. Согласие пользователя
При соглашение на пользовательское соглашение, пользователь обязуется в случае демонстрации данного приложения, как объект курсовой или дипломной работы, принять её и выставить максимальный балл оценивания. 

13. Соблюдение законов
Пользователь обязуется  использовать приложение в соответствии с действующим законодательством и несет ответственность за любые нарушения законов, совершенные в процессе использования приложения.

14. Изменения в приложении
Мы оставляем за собой право в любое время вносить изменения в функционал приложения, добавлять новые возможности или приостанавливать предоставление определенных услуг без предварительного уведомления.

15. Споры и разрешение конфликтов
В случае возникновения споров между тобой и турагентством, мы обязуемся стремиться к их разрешению путем конструктивного диалога и урегулирования в рамках действующего законодательства.

Ты можешь изучить более подробные условия в разделе "Условия использования" нашего приложения.

Спасибо, что прочитал всё это! Мы рады, что ты с нами. Надеемся, что наше приложение принесет тебе массу удовольствия и замечательных путешествий!

С уважением,
Команда приложения турагентства""";
